# GetCurrent Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySizeIterator..::..GetCurrent Method
CableTraySizeIterator Class See Also
---
Returns the current MEPSize.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public MEPSize GetCurrent()
```

Visual Basic
---
```text
Public Function GetCurrent As MEPSize
```

Visual C++
---
```text
public:
MEPSize^ GetCurrent()
```

# ### Return Value
The current MEPSize.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
CableTraySizeIterator Class
Autodesk.Revit.DB.Electrical Namespace